# DrawLayer Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageInstance..::..DrawLayer Property
ImageInstance Class See Also
---
The layer the ImageInstance will be drawn in.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public DrawLayer DrawLayer { get; set; }
```

Visual Basic
---
```text
Public Property DrawLayer As DrawLayer
	Get
	Set
```

Visual C++
---
```text
public:
property DrawLayer DrawLayer {
	DrawLayer get ();
	void set (DrawLayer value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ImageInstance Class
Autodesk.Revit.DB Namespace